AUTO_config_TK_pesok/src/Catalogs/ТочкиДоставки/ТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиДоставки</name>
  <comment>Точки доставки контрагентов</comment>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Район</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипГорода</name>
    <type>
      <types>CatalogRef.ТК_ТипГородов</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.ТК_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечРайонГорода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонГорода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУлицы</name>
    <type>
      <types>CatalogRef.ТК_ТипУлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <comment>Вспомогательное поле: улица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <comment>Вспомогательное поле: дом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <comment>Вспомогательное поле: корпус</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <comment>Вспомогательное поле: квартира</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <comment>Вспомогательное поле:Код страны или Индекс</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодJTI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок загрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСигаретный</name>
    <comment>Порядок загрузки сигаретный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GPS_X</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GPS_Y</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ТочкиДоставки/ManagerModule.bsl
Функция НайтиАдресДоставкиПоGLN(Контрагент,АдресДоставкиGLN)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТочкиДоставки.Ссылка Как АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Контрагент
	|	И ТочкиДоставки.GLN = &GLN";
	
	Запрос.УстановитьПараметр("GLN", АдресДоставкиGLN);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресДоставки;

КонецФункции

Функция НайтиАдресДоставкиПоGlobal_ID(Global_ID)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Global_ID = &Global_ID";
	
	Запрос.УстановитьПараметр("Global_ID", Global_ID);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.ТочкиДоставки.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресДоставки;

КонецФункции
